from autoregressive import autoregressive_models
from gan import GAN

서론 = f"다양한 종류의 Deep generative model들이 최근에 다양한 데이터 모달리티에서 높은 품질의 샘플을 보여주고 있습니다.\
        생성적 적대 신경망({GAN}),  {autoregressive_models}, 플로우, 그리고 변분 오토인코더(VAE)들이\
        이미지와 오디오 샘플에서 놀라운 결과를 보여주었으며 [14, 27, 3, 58, 38, 25, 10, 32, 44, 57, 26, 33, 45],\
        에너지 기반 모델링과 스코어 매칭 분야에서도 GAN에 필적하는 이미지를 생성하는 놀라운 진전이 있었습니다 [11, 55]."

서론_2 = "이 논문은 디퓨전 확률 모델의 발전을 제시합니다 [53]. 디퓨전 확률 모델(간단히 디퓨전 모델이라고 부름)은 유한 시간 후에 데이터와 일치하는\
    샘플을 생성하도록 변분 추론을 사용하여 학습된 파라미터화된 마르코프 체인입니다. 이 체인의 전이들은 샘플링의 반대 방향으로 데이터에 점진적으로 \
    노이즈를 추가하는 디퓨전 과정을 역전시키도록 학습됩니다. 디퓨전이 작은 양의 가우시안 노이즈로 구성될 때, 샘플링 체인 전이를 조건부 가우시안으로 설정하는 것이 충분하며,\
    이는 특히 단순한 신경망 파라미터화를 가능하게 합니다.디퓨전 모델은 정의하기 쉽고 학습하기 효율적이지만, 우리가 아는 한 지금까지 고품질 샘플을\
    생성할 수 있다는 것을 보여주는 데모가 없었습니다. 우리는 디퓨전 모델이 실제로 고품질 샘플을 생성할 수 있으며, 때로는 다른 종류의 생성 모델들의\
    발표된 결과보다 더 나은 결과를 보여줄 수 있음을 보여줍니다 (4장). 또한, 우리는 디퓨전 모델의 특정 파라미터화가 학습 중에는 여러 노이즈 \
    레벨에서의 노이즈 제거 스코어 매칭과 샘플링 중에는 어닐링된 랑주뱅 역학과 동등함을 보여줍니다 (3.2장) [55, 61]. 우리는 이 파라미터화를\
    사용하여 최고의 샘플 품질 결과를 얻었으므로 (4.2장), 이 동등성을 우리의 주요 기여 중 하나로 간주합니다.\
    샘플 품질에도 불구하고, 우리의 모델은 다른 가능도 기반 모델들과 비교했을 때 경쟁력 있는 로그 가능도를 가지고 있지 않습니다 (하지만 우리의 모델은 에너지 기반 모델과 스코어 매칭에 대해 어닐링된 중요도 샘플링이 생성한다고 보고된 큰 추정치보다는 더 나은 로그 가능도를 가지고 있습니다 [11, 55]). 우리는 우리 모델의 무손실 코드 길이의 대부분이 지각할 수 없는 이미지 세부 사항을 설명하는 데 소비된다는 것을 발견했습니다 (4.3장). 우리는 이 현상을 손실 압축의 언어로 더 정교한 분석을 제시하며, 디퓨전 모델의 샘플링 절차가 일반적으로 자기회귀 모델에서 가능한 것보다 훨씬 더 일반화된 비트 순서를 따라 자기회귀 디코딩과 유사한 점진적 디코딩의 한 유형임을 보여줍니다."
